<?xml version="1.0" ?>
<net batch="1" name="XYZ_RoNIN_v0.5" version="6">
	<layers>
		<layer id="0" name="input" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="133/reshape/Dim4709_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="16"/>
			</blobs>
		</layer>
		<layer id="2" name="133/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="133" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,7" output="72" pads_begin="0,3" pads_end="0,3" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16" size="6048"/>
				<biases offset="6064" size="144"/>
			</blobs>
		</layer>
		<layer id="4" name="133/reshape/Dim47114713_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6208" size="12"/>
			</blobs>
		</layer>
		<layer id="5" name="133/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="135" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="136/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6220" size="4"/>
			</blobs>
		</layer>
		<layer id="8" name="136221" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="137" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="138/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6220" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="138" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="139/reshape/Dim4573_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="13" name="139/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="139" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6240" size="31104"/>
				<biases offset="37344" size="144"/>
			</blobs>
		</layer>
		<layer id="15" name="139/reshape/Dim45754577_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="16" name="139/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="141" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="142/reshape/Dim4725_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="19" name="142/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="142" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="37500" size="31104"/>
				<biases offset="68604" size="144"/>
			</blobs>
		</layer>
		<layer id="21" name="142/reshape/Dim47274729_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="22" name="142/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="144" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="145" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="146/reshape/Dim4621_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="26" name="146/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="146" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="68748" size="31104"/>
				<biases offset="99852" size="144"/>
			</blobs>
		</layer>
		<layer id="28" name="146/reshape/Dim46234625_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="29" name="146/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="148" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="149/reshape/Dim4733_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="32" name="149/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="149" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="99996" size="31104"/>
				<biases offset="131100" size="144"/>
			</blobs>
		</layer>
		<layer id="34" name="149/reshape/Dim47354737_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="35" name="149/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="151" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="152" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="153/reshape/Dim4685_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="39" name="153/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="153" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="131244" size="62208"/>
				<biases offset="193452" size="288"/>
			</blobs>
		</layer>
		<layer id="41" name="153/reshape/Dim46874689_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193740" size="12"/>
			</blobs>
		</layer>
		<layer id="42" name="153/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="155" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="156/reshape/Dim4653_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193752" size="16"/>
			</blobs>
		</layer>
		<layer id="45" name="156/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="156" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="193768" size="124416"/>
				<biases offset="318184" size="288"/>
			</blobs>
		</layer>
		<layer id="47" name="156/reshape/Dim46554657_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193740" size="12"/>
			</blobs>
		</layer>
		<layer id="48" name="156/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="158/reshape/Dim4645_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="50" name="158/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="158" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="318472" size="20736"/>
				<biases offset="339208" size="288"/>
			</blobs>
		</layer>
		<layer id="52" name="158/reshape/Dim46474649_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193740" size="12"/>
			</blobs>
		</layer>
		<layer id="53" name="158/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="160" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="161" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="162/reshape/Dim4613_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193752" size="16"/>
			</blobs>
		</layer>
		<layer id="57" name="162/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="162" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="339496" size="124416"/>
				<biases offset="463912" size="288"/>
			</blobs>
		</layer>
		<layer id="59" name="162/reshape/Dim46154617_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193740" size="12"/>
			</blobs>
		</layer>
		<layer id="60" name="162/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="164" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="165/reshape/Dim4629_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193752" size="16"/>
			</blobs>
		</layer>
		<layer id="63" name="165/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="165" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="464200" size="124416"/>
				<biases offset="588616" size="288"/>
			</blobs>
		</layer>
		<layer id="65" name="165/reshape/Dim46314633_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193740" size="12"/>
			</blobs>
		</layer>
		<layer id="66" name="165/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="167" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="168" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="169/reshape/Dim4693_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193752" size="16"/>
			</blobs>
		</layer>
		<layer id="70" name="169/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="169" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="588904" size="248832"/>
				<biases offset="837736" size="576"/>
			</blobs>
		</layer>
		<layer id="72" name="169/reshape/Dim46954697_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838312" size="12"/>
			</blobs>
		</layer>
		<layer id="73" name="169/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="171" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="172/reshape/Dim4637_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838324" size="16"/>
			</blobs>
		</layer>
		<layer id="76" name="172/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="172" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="838340" size="497664"/>
				<biases offset="1336004" size="576"/>
			</blobs>
		</layer>
		<layer id="78" name="172/reshape/Dim46394641_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838312" size="12"/>
			</blobs>
		</layer>
		<layer id="79" name="172/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="174/reshape/Dim4581_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="193752" size="16"/>
			</blobs>
		</layer>
		<layer id="81" name="174/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="174" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1336580" size="82944"/>
				<biases offset="1419524" size="576"/>
			</blobs>
		</layer>
		<layer id="83" name="174/reshape/Dim45834585_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838312" size="12"/>
			</blobs>
		</layer>
		<layer id="84" name="174/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="176" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="177" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="178/reshape/Dim4661_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838324" size="16"/>
			</blobs>
		</layer>
		<layer id="88" name="178/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="178" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1420100" size="497664"/>
				<biases offset="1917764" size="576"/>
			</blobs>
		</layer>
		<layer id="90" name="178/reshape/Dim46634665_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838312" size="12"/>
			</blobs>
		</layer>
		<layer id="91" name="178/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="180" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="181/reshape/Dim4701_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838324" size="16"/>
			</blobs>
		</layer>
		<layer id="94" name="181/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="181" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1918340" size="497664"/>
				<biases offset="2416004" size="576"/>
			</blobs>
		</layer>
		<layer id="96" name="181/reshape/Dim47034705_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838312" size="12"/>
			</blobs>
		</layer>
		<layer id="97" name="181/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="183" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="184" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="185/reshape/Dim4605_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838324" size="16"/>
			</blobs>
		</layer>
		<layer id="101" name="185/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="185" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="576" pads_begin="0,1" pads_end="0,1" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2416580" size="995328"/>
				<biases offset="3411908" size="1152"/>
			</blobs>
		</layer>
		<layer id="103" name="185/reshape/Dim46074609_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413060" size="12"/>
			</blobs>
		</layer>
		<layer id="104" name="185/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="187" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="188/reshape/Dim4597_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413072" size="16"/>
			</blobs>
		</layer>
		<layer id="107" name="188/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="188" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="576" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3413088" size="1990656"/>
				<biases offset="5403744" size="1152"/>
			</blobs>
		</layer>
		<layer id="109" name="188/reshape/Dim45994601_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413060" size="12"/>
			</blobs>
		</layer>
		<layer id="110" name="188/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="190/reshape/Dim4589_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="838324" size="16"/>
			</blobs>
		</layer>
		<layer id="112" name="190/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="190" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5404896" size="331776"/>
				<biases offset="5736672" size="1152"/>
			</blobs>
		</layer>
		<layer id="114" name="190/reshape/Dim45914593_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413060" size="12"/>
			</blobs>
		</layer>
		<layer id="115" name="190/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="192" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="193" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="194/reshape/Dim4717_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413072" size="16"/>
			</blobs>
		</layer>
		<layer id="119" name="194/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="194" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="576" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5737824" size="1990656"/>
				<biases offset="7728480" size="1152"/>
			</blobs>
		</layer>
		<layer id="121" name="194/reshape/Dim47194721_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413060" size="12"/>
			</blobs>
		</layer>
		<layer id="122" name="194/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="196" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="197/reshape/Dim4677_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413072" size="16"/>
			</blobs>
		</layer>
		<layer id="125" name="197/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="197" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="576" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7729632" size="1990656"/>
				<biases offset="9720288" size="1152"/>
			</blobs>
		</layer>
		<layer id="127" name="197/reshape/Dim46794681_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413060" size="12"/>
			</blobs>
		</layer>
		<layer id="128" name="197/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="199" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="200" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="201/reshape/Dim4669_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3413072" size="16"/>
			</blobs>
		</layer>
		<layer id="132" name="201/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="201" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9721440" size="147456"/>
				<biases offset="9868896" size="256"/>
			</blobs>
		</layer>
		<layer id="134" name="201/reshape/Dim46714673_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="9869152" size="12"/>
			</blobs>
		</layer>
		<layer id="135" name="201/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="209/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="9869164" size="8"/>
			</blobs>
		</layer>
		<layer id="137" name="210" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>896</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="211" precision="FP16" type="FullyConnected">
			<data out-size="512"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>896</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9869172" size="917504"/>
				<biases offset="10786676" size="1024"/>
			</blobs>
		</layer>
		<layer id="139" name="212" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="213" precision="FP16" type="FullyConnected">
			<data out-size="512"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10787700" size="524288"/>
				<biases offset="11311988" size="1024"/>
			</blobs>
		</layer>
		<layer id="141" name="214" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="output" precision="FP16" type="FullyConnected">
			<data out-size="3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11313012" size="3072"/>
				<biases offset="11316084" size="6"/>
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="5" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="5" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0"/>
