<?xml version="1.0" ?>
<net batch="1" name="XYZ_RoNIN_v0-6" version="6">
	<layers>
		<layer id="0" name="input" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="229/reshape/Dim7981_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="16"/>
			</blobs>
		</layer>
		<layer id="2" name="229/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="229" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,7" output="72" pads_begin="0,3" pads_end="0,3" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16" size="6048"/>
				<biases offset="6064" size="144"/>
			</blobs>
		</layer>
		<layer id="4" name="229/reshape/Dim79837985_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6208" size="12"/>
			</blobs>
		</layer>
		<layer id="5" name="229/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="231" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="232/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6220" size="4"/>
			</blobs>
		</layer>
		<layer id="8" name="232373" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="233" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="234/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6220" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="234" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="235/reshape/Dim7869_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="13" name="235/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="235" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6240" size="31104"/>
				<biases offset="37344" size="144"/>
			</blobs>
		</layer>
		<layer id="15" name="235/reshape/Dim78717873_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="16" name="235/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="237" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="238/reshape/Dim7813_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="19" name="238/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="238" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="37500" size="31104"/>
				<biases offset="68604" size="144"/>
			</blobs>
		</layer>
		<layer id="21" name="238/reshape/Dim78157817_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="22" name="238/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="240" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="241" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="242/reshape/Dim7933_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="26" name="242/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="242" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="68748" size="31104"/>
				<biases offset="99852" size="144"/>
			</blobs>
		</layer>
		<layer id="28" name="242/reshape/Dim79357937_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="29" name="242/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="244" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="245/reshape/Dim7901_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="32" name="245/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="245" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="99996" size="31104"/>
				<biases offset="131100" size="144"/>
			</blobs>
		</layer>
		<layer id="34" name="245/reshape/Dim79037905_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="35" name="245/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="247" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="248" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="249/reshape/Dim7725_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="39" name="249/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="249" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="131244" size="31104"/>
				<biases offset="162348" size="144"/>
			</blobs>
		</layer>
		<layer id="41" name="249/reshape/Dim77277729_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="42" name="249/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="251" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="252/reshape/Dim7949_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="45" name="252/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="252" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="72" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
			<blobs>
				<weights offset="162492" size="31104"/>
				<biases offset="193596" size="144"/>
			</blobs>
		</layer>
		<layer id="47" name="252/reshape/Dim79517953_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37488" size="12"/>
			</blobs>
		</layer>
		<layer id="48" name="252/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="254" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="255" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="256/reshape/Dim7853_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="52" name="256/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="256" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="193740" size="62208"/>
				<biases offset="255948" size="288"/>
			</blobs>
		</layer>
		<layer id="54" name="256/reshape/Dim78557857_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="55" name="256/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="258" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="259/reshape/Dim7821_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="58" name="259/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="259" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="256264" size="124416"/>
				<biases offset="380680" size="288"/>
			</blobs>
		</layer>
		<layer id="60" name="259/reshape/Dim78237825_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="61" name="259/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="261/reshape/Dim7877_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6224" size="16"/>
			</blobs>
		</layer>
		<layer id="63" name="261/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="261" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="380968" size="20736"/>
				<biases offset="401704" size="288"/>
			</blobs>
		</layer>
		<layer id="65" name="261/reshape/Dim78797881_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="66" name="261/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="263" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="264" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="265/reshape/Dim7749_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="70" name="265/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="265" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="401992" size="124416"/>
				<biases offset="526408" size="288"/>
			</blobs>
		</layer>
		<layer id="72" name="265/reshape/Dim77517753_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="73" name="265/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="267" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="268/reshape/Dim7757_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="76" name="268/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="268" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="526696" size="124416"/>
				<biases offset="651112" size="288"/>
			</blobs>
		</layer>
		<layer id="78" name="268/reshape/Dim77597761_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="79" name="268/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="270" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="271" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="272/reshape/Dim7741_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="83" name="272/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="272" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="651400" size="124416"/>
				<biases offset="775816" size="288"/>
			</blobs>
		</layer>
		<layer id="85" name="272/reshape/Dim77437745_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="86" name="272/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="274" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="275/reshape/Dim7829_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="89" name="275/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="275" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="776104" size="124416"/>
				<biases offset="900520" size="288"/>
			</blobs>
		</layer>
		<layer id="91" name="275/reshape/Dim78317833_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="92" name="275/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="277" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="278" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="279/reshape/Dim7717_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="96" name="279/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="279" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="900808" size="124416"/>
				<biases offset="1025224" size="288"/>
			</blobs>
		</layer>
		<layer id="98" name="279/reshape/Dim77197721_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="99" name="279/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="281" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="282/reshape/Dim7957_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="102" name="282/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="282" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="144" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1025512" size="124416"/>
				<biases offset="1149928" size="288"/>
			</blobs>
		</layer>
		<layer id="104" name="282/reshape/Dim79597961_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256236" size="12"/>
			</blobs>
		</layer>
		<layer id="105" name="282/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="284" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="285" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="286/reshape/Dim7989_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="109" name="286/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="286" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1150216" size="248832"/>
				<biases offset="1399048" size="576"/>
			</blobs>
		</layer>
		<layer id="111" name="286/reshape/Dim79917993_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399624" size="12"/>
			</blobs>
		</layer>
		<layer id="112" name="286/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="288" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="289/reshape/Dim7789_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399636" size="16"/>
			</blobs>
		</layer>
		<layer id="115" name="289/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="289" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1399652" size="497664"/>
				<biases offset="1897316" size="576"/>
			</blobs>
		</layer>
		<layer id="117" name="289/reshape/Dim77917793_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399624" size="12"/>
			</blobs>
		</layer>
		<layer id="118" name="289/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="291/reshape/Dim7909_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="256248" size="16"/>
			</blobs>
		</layer>
		<layer id="120" name="291/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="291" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1897892" size="82944"/>
				<biases offset="1980836" size="576"/>
			</blobs>
		</layer>
		<layer id="122" name="291/reshape/Dim79117913_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399624" size="12"/>
			</blobs>
		</layer>
		<layer id="123" name="291/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="293" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="294" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="295/reshape/Dim7965_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399636" size="16"/>
			</blobs>
		</layer>
		<layer id="127" name="295/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="295" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1981412" size="497664"/>
				<biases offset="2479076" size="576"/>
			</blobs>
		</layer>
		<layer id="129" name="295/reshape/Dim79677969_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399624" size="12"/>
			</blobs>
		</layer>
		<layer id="130" name="295/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="297" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="298/reshape/Dim7925_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399636" size="16"/>
			</blobs>
		</layer>
		<layer id="133" name="298/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="298" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2479652" size="497664"/>
				<biases offset="2977316" size="576"/>
			</blobs>
		</layer>
		<layer id="135" name="298/reshape/Dim79277929_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399624" size="12"/>
			</blobs>
		</layer>
		<layer id="136" name="298/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="300" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="301" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="302/reshape/Dim7917_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399636" size="16"/>
			</blobs>
		</layer>
		<layer id="140" name="302/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="302" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,3" output="288" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2977892" size="497664"/>
				<biases offset="3475556" size="576"/>
			</blobs>
		</layer>
		<layer id="142" name="302/reshape/Dim79197921_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1399624" size="12"/>
			</blobs>
		</layer>
		<layer id="143" name="302/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="304" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="305/reshape/Dim7733_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
